tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiSpeciesTransportFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5000;//

deltaT          1;

writeControl    timeStep;

writeInterval   5000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;


timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

checkFrequency  10000;

// ************************************************************************* //
