tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 5e-6;

lx0 0;
ly0 0;
lz0 0;
lx 412;
ly 400;
lz 400;


vertices
(
    ($lx0       $ly0    $lz0)
    ($lx        $ly0    $lz0)
    ($lx        $ly     $lz0)
    ($lx0       $ly     $lz0)
    ($lx0       $ly0    $lz)
    ($lx        $ly0    $lz)
    ($lx        $ly     $lz)
    ($lx0       $ly     $lz)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (nx ny nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  bottom 
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    
   top 
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

   left 
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

   right 
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

   front 
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

   back 
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
